In [3]:
import pandas as pd

In [4]:
id_attr = [1,2,3,4]
name_attr = ['Joe', 'Henry', 'Sam', 'Max']
salary = [70000, 80000, 60000, 90000]
manager_id = [3,4, 'NULL', 'NULL']

dict1 = {'ID' : id_attr, 'ame': name_attr, 'salary': salary, 'manager_id':manager_id}

In [5]:
df2 = pd.DataFrame(dict1)

df2

   ID    ame  salary manager_id
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       NULL
3   4    Max   90000       NULL